# Introduction

In this project, we will be looking at movie datasets in order to give recommendations to a new movie studio.

 - *Introduction explains the real-world problem the project aims to solve.*
 - *Introduction identifies stakeholders who could use the project and how they would use it.*

# Objectives (*Goals*)
 - Import datasets and do an initial viewing. (*Data*)
 - Ask some relevant questions! (*Methods*)
 - Find the answers to those questions (*Results*)
 - Conclusion

## Datasets
The data for this project comes from https://www.boxofficemojo.com/ and https://www.imdb.com/

### IMDB Dataset

First we are going to `import sqlite3` and `pandas`. Then we will connect to the dataset and find the datasets table names.

In [34]:
import sqlite3 as sql
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import zipfile

In [35]:
with zipfile.ZipFile('zipped_data/im.db.zip', 'r') as zip_ref:
    zip_ref.extractall('data')

In [36]:
# create connection to the database and cursor object:
conn = sql.connect('data/im.db')
cur = conn.cursor()
# find table names
cur.execute("""SELECT name FROM sqlite_master WHERE type = 'table';""")
# fetch the result and store it in table_names
table_names = cur.fetchall()
table_names

[('movie_basics',),
 ('directors',),
 ('known_for',),
 ('movie_akas',),
 ('movie_ratings',),
 ('persons',),
 ('principals',),
 ('writers',)]

Above we see 8 tables names - lets look into those tables now.

For the `movie_basics` table:

In [37]:
# creating movie_basics dataframe
imbd_movie_basics = pd.read_sql("""SELECT * FROM movie_basics;
                                """, conn)
imbd_movie_basics

,movie_id,primary_title,original_title,start_year,runtime_minutes,genres
0,tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama"
1,tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama"
2,tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama
3,tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama"
4,tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy"
...,...,...,...,...,...,...
146139,tt9916538,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,2019,123.0,Drama
146140,tt9916622,Rodolpho Teóphilo - O Legado de um Pioneiro,Rodolpho Teóphilo - O Legado de um Pioneiro,2015,NaN,Documentary
146141,tt9916706,Dankyavar Danka,Dankyavar Danka,2013,NaN,Comedy
146142,tt9916730,6 Gunn,6 Gunn,2017,116.0,None
146143,tt9916754,Chico Albuquerque - Revelações,Chico Albuquerque - Revelações,2013,NaN,Documentary


For the `directors` table:

In [38]:
# creating a dataframe for the directors table
imbd_directors = pd.read_sql("""SELECT * FROM directors;
                                """, conn)
imbd_directors

         movie_id   person_id
0       tt0285252   nm0899854
1       tt0462036   nm1940585
2       tt0835418   nm0151540
3       tt0835418   nm0151540
4       tt0878654   nm0089502
...           ...         ...
291169  tt8999974  nm10122357
291170  tt9001390   nm6711477
291171  tt9001494  nm10123242
291172  tt9001494  nm10123248
291173  tt9004986   nm4993825

[291174 rows x 2 columns]



For the `known_for` table:

In [39]:
# getting data and creating the dataframe for the known_for table
imbd_known_for = pd.read_sql("""SELECT * FROM known_for;
                                """, conn)
imbd_known_for

         person_id   movie_id
0        nm0061671  tt0837562
1        nm0061671  tt2398241
2        nm0061671  tt0844471
3        nm0061671  tt0118553
4        nm0061865  tt0896534
...            ...        ...
1638255  nm9990690  tt9090932
1638256  nm9990690  tt8737130
1638257  nm9991320  tt8734436
1638258  nm9991320  tt9615610
1638259  nm9993380  tt8743182

[1638260 rows x 2 columns]

For the `movie_akas` table:

In [40]:
# creating the dataframe for the movie_akas table#
imbd_movie_akas = pd.read_sql("""SELECT * FROM movie_akas;
                                """, conn)
imbd_movie_akas

,movie_id,ordering,title,region,language,types,attributes,is_original_title
0,tt0369610,10,Джурасик свят,BG,bg,None,None,0.0
1,tt0369610,11,Jurashikku warudo,JP,None,imdbDisplay,None,0.0
2,tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,None,imdbDisplay,None,0.0
3,tt0369610,13,O Mundo dos Dinossauros,BR,None,None,short title,0.0
4,tt0369610,14,Jurassic World,FR,None,imdbDisplay,None,0.0
...,...,...,...,...,...,...,...,...
331698,tt9827784,2,Sayonara kuchibiru,None,None,original,None,1.0
331699,tt9827784,3,Farewell Song,XWW,en,imdbDisplay,None,0.0
331700,tt9880178,1,La atención,None,None,original,None,1.0
331701,tt9880178,2,La atención,ES,None,None,None,0.0
331702,tt9880178,3,The Attention,XWW,en,imdbDisplay,None,0.0

For the `movie_ratings` table:

In [41]:
# creating the dataframe for the movie_ratings table
imbd_movie_ratings = pd.read_sql("""SELECT * FROM movie_ratings;
                                """, conn)
imbd_movie_ratings

         movie_id  averagerating  numvotes
0      tt10356526            8.3        31
1      tt10384606            8.9       559
2       tt1042974            6.4        20
3       tt1043726            4.2     50352
4       tt1060240            6.5        21
...           ...            ...       ...
73851   tt9805820            8.1        25
73852   tt9844256            7.5        24
73853   tt9851050            4.7        14
73854   tt9886934            7.0         5
73855   tt9894098            6.3       128

[73856 rows x 3 columns]

For the `persons` table:

In [42]:
# creating the dataframe for the persons table
imbd_persons = pd.read_sql("""SELECT * FROM persons;
                                """, conn)
imbd_persons

,person_id,primary_name,birth_year,death_year,primary_profession
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator"
...,...,...,...,...,...
606643,nm9990381,Susan Grobes,NaN,NaN,actress
606644,nm9990690,Joo Yeon So,NaN,NaN,actress
606645,nm9991320,Madeline Smith,NaN,NaN,actress
606646,nm9991786,Michelle Modigliani,NaN,NaN,producer
606647,nm9993380,Pegasus Envoyé,NaN,NaN,"director,actor,writer"

For the `principals` table:

In [43]:
# creating the dataframe for the principals table
imbd_principals = pd.read_sql("""SELECT * FROM principals;
                                """, conn)
imbd_principals

,movie_id,ordering,person_id,category,job,characters
0,tt0111414,1,nm0246005,actor,None,"[""The Man""]"
1,tt0111414,2,nm0398271,director,None,None
2,tt0111414,3,nm3739909,producer,producer,None
3,tt0323808,10,nm0059247,editor,None,None
4,tt0323808,1,nm3579312,actress,None,"[""Beth Boothby""]"
...,...,...,...,...,...,...
1028181,tt9692684,1,nm0186469,actor,None,"[""Ebenezer Scrooge""]"
1028182,tt9692684,2,nm4929530,self,None,"[""Herself"",""Regan""]"
1028183,tt9692684,3,nm10441594,director,None,None
1028184,tt9692684,4,nm6009913,writer,writer,None
1028185,tt9692684,5,nm10441595,producer,producer,None

For the `writers` table:

In [44]:
# creating the dataframe for the writers table
imbd_writers = pd.read_sql("""SELECT * FROM writers;
                                """, conn)
imbd_writers

         movie_id   person_id
0       tt0285252   nm0899854
1       tt0438973   nm0175726
2       tt0438973   nm1802864
3       tt0462036   nm1940585
4       tt0835418   nm0310087
...           ...         ...
255868  tt8999892  nm10122246
255869  tt8999974  nm10122357
255870  tt9001390   nm6711477
255871  tt9004986   nm4993825
255872  tt9010172   nm8352242

[255873 rows x 2 columns]

### Box Office Mojo (BOM) Dataset

First we are going to read, create a dataframe, and check the column value types for the BOM dataset (`bom_df`).

In [45]:
bom_df = pd.read_csv('zipped_data/bom.movie_gross (1).csv.gz')
print(bom_df.dtypes)
bom_df

title              object
studio             object
domestic_gross    float64
foreign_gross      object
year                int64
dtype: object

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010
...,...,...,...,...,...
3382,The Quake,Magn.,6200.0,NaN,2018
3383,Edward II (2018 re-release),FM,4800.0,NaN,2018
3384,El Pacto,Sony,2500.0,NaN,2018
3385,The Swan,Synergetic,2400.0,NaN,2018
3386,An Actor Prepares,Grav.,1700.0,NaN,2018

## Questions about the data:

- Do certain genres result in higher grossing films?
- Is there a correlation between specific actors and higher grossing films?
- Do movies with higher ratings result in higher grossing films?
- Does the length of the movie have anything to do with the how much money the film makes?

Hopefully, after answering these questions we will have some reccomendations for movie studios to help direct them on how to make high-grossing, successfull films!

### Do certain genres result in higher grossing films?
In order to answer this question we need to make sure our datatypes are the way we want them. In the code cell above, we saw that in `bom_df`, the `foreign_gross` column type was `object`. We need to change this to `float`, so that it will be an number, not an object.

In [46]:
bom_df = bom_df.astype({'foreign_gross': np.float})

ValueError: could not convert string to float: '1,131.6'

Shoot! Seems like we need to do some data cleaning to get the data the way we want it. Lets remove the commas and then see if our code will run.

In [48]:
bom_df['foreign_gross'] = bom_df['foreign_gross'].str.replace(',','')
bom_df

,title,studio,domestic_gross,foreign_gross,year
0,Toy Story 3,BV,415000000.0,652000000,2010
1,Alice in Wonderland (2010),BV,334200000.0,691300000,2010
2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000,2010
3,Inception,WB,292600000.0,535700000,2010
4,Shrek Forever After,P/DW,238700000.0,513900000,2010
...,...,...,...,...,...
3382,The Quake,Magn.,6200.0,NaN,2018
3383,Edward II (2018 re-release),FM,4800.0,NaN,2018
3384,El Pacto,Sony,2500.0,NaN,2018
3385,The Swan,Synergetic,2400.0,NaN,2018
3386,An Actor Prepares,Grav.,1700.0,NaN,2018

Okay, lets re-run our previous code to change `foreign_gross`'s data type from `object` to `float`.

In [49]:
bom_df = bom_df.astype({'foreign_gross': np.float})
print(bom_df.dtypes)

title              object
studio             object
domestic_gross    float64
foreign_gross     float64
year                int64
dtype: object

Next, lets save `bom_df` in a SQLite database, so that we can then use SQLite to join and query the `bom_df` data set and the `imbd_movie_basics` data set.

In [50]:
bom_df.to_sql('bom_df', conn)

Now we can query `bom_df` using SQLite.

In [51]:
 pd.read_sql("""SELECT * FROM bom_df;
                                """, conn)

,index,title,studio,domestic_gross,foreign_gross,year
0,0,Toy Story 3,BV,415000000.0,652000000.0,2010
1,1,Alice in Wonderland (2010),BV,334200000.0,691300000.0,2010
2,2,Harry Potter and the Deathly Hallows Part 1,WB,296000000.0,664300000.0,2010
3,3,Inception,WB,292600000.0,535700000.0,2010
4,4,Shrek Forever After,P/DW,238700000.0,513900000.0,2010
...,...,...,...,...,...,...
3382,3382,The Quake,Magn.,6200.0,NaN,2018
3383,3383,Edward II (2018 re-release),FM,4800.0,NaN,2018
3384,3384,El Pacto,Sony,2500.0,NaN,2018
3385,3385,The Swan,Synergetic,2400.0,NaN,2018
3386,3386,An Actor Prepares,Grav.,1700.0,NaN,2018

Now we're going to join the two tables based on movie title and year.

In [88]:
bom_movie_basics_joined = pd.read_sql('''
    SELECT bom_df.title, bom_df.domestic_gross, bom_df.foreign_gross, movie_basics.genres, bom_df.year
    FROM bom_df
        INNER JOIN movie_basics
        ON bom_df.title=movie_basics.original_title AND bom_df.year=movie_basics.start_year
    ORDER BY foreign_gross DESC;
''', conn)
bom_movie_basics_joined

,title,domestic_gross,foreign_gross,genres,year
0,Avengers: Age of Ultron,459000000.0,946400000.0,"Action,Adventure,Sci-Fi",2015
1,Jurassic World: Fallen Kingdom,417700000.0,891800000.0,"Action,Adventure,Sci-Fi",2018
2,Frozen,400700000.0,875700000.0,"Adventure,Animation,Comedy",2013
3,Transformers: Age of Extinction,245400000.0,858600000.0,"Action,Adventure,Sci-Fi",2014
4,Minions,336000000.0,823400000.0,"Adventure,Animation,Comedy",2015
...,...,...,...,...,...
1661,The House That Jack Built,88000.0,NaN,"Crime,Drama,Horror",2018
1662,Helicopter Eela,72000.0,NaN,Drama,2018
1663,Oolong Courtyard,37700.0,NaN,Comedy,2018
1664,The Workshop,22100.0,NaN,Thriller,2018
1665,An Actor Prepares,1700.0,NaN,Comedy,2018

Now lets check for duplicated files:

In [84]:
bom_movie_basics_joined[bom_movie_basics_joined["title"].duplicated()]

,title,domestic_gross,foreign_gross,genres,year
25,Coco,209700000.0,597400000.0,Horror,2017
333,The Artist,44700000.0,88800000.0,Thriller,2011
356,Lights Out,67300000.0,81600000.0,"Drama,Horror,Mystery",2016
388,The Bounty Hunter,67099999.0,69300000.0,"Action,Comedy,Romance",2010
451,Abduction,28100000.0,54000000.0,"Horror,Thriller",2011
454,Truth or Dare,41400000.0,53900000.0,"Horror,Thriller",2018
461,Spotlight,45100000.0,53200000.0,Drama,2015
477,The Walk,10100000.0,51000000.0,"Crime,Thriller",2015
482,Burlesque,39400000.0,50100000.0,"Drama,Music,Musical",2010
534,Legend,1900000.0,41100000.0,Horror,2015
578,The Visit,65200000.0,33200000.0,"Horror,Mystery,Thriller",2015
733,Sisters,87000000.0,18000000.0,Comedy,2015
776,Big Eyes,14500000.0,14800000.0,Documentary,2014
811,Sleepless,20800000.0,12100000.0,"Drama,War",2017
831,The Forest,26600000.0,11000000.0,"Horror,Mystery,Thriller",2016
858,The Night Before,43000000.0,9300000.0,Documentary,2015
915,Gone,11700000.0,6400000.0,Drama,2012
981,Stronger,4200000.0,4200000.0,Drama,2017
1019,The Wall,1800000.0,2700000.0,Documentary,2017
1020,The Wall,1800000.0,2700000.0,Documentary,2017
1024,Cyrus,7500000.0,2500000.0,"Crime,Horror,Mystery",2010
1160,I'm Still Here,409000.0,160000.0,"Comedy,Drama,Music",2010
1178,The Tempest,278000.0,68700.0,Drama,2010
1306,The Bay,30700.0,NaN,"Horror,Sci-Fi,Thriller",2012
1364,Addicted,17400000.0,NaN,"Drama,Thriller",2014
1384,Jai Ho,1300000.0,NaN,"Biography,Documentary,Music",2014
1435,True Story,4700000.0,NaN,Drama,2015
1492,Extraction,16800.0,NaN,"Action,Crime,Thriller",2015
1522,Denial,4099999.0,NaN,Documentary,2016
1563,Dancer,71900.0,NaN,"Biography,Documentary",2016
1572,The Other Side,8100.0,NaN,Thriller,2016
1607,The Journey,155000.0,NaN,"Drama,Thriller",2017
1626,They Shall Not Grow Old,18000000.0,NaN,"Documentary,History,War",2018
1634,Colette,5100000.0,NaN,"Documentary,Mystery",2018
1653,The Guardians,177000.0,NaN,Documentary,2018
1658,The Negotiation,111000.0,NaN,"Documentary,History,War",2018